[
    {
        "name": "Apple-gourd",
        "imagename": "Apple-gourd",
        "description": "Apple gourd is a green, oval or round-shaped vegetable, also known as Indian squash, round melon, Indian round gourd, or tinda. This vegetable is nutrient-dense and has an abundance of antioxidants and bioactive compounds, which makes it a superfood."
    },
    {
        "name": "Artichoke",
        "imagename": "Artichoke",
        "description": "The artichoke's flavour is delicate and nutlike, and the smaller heads, or buds, are usually the most tender. Artichoke heads are commonly boiled or steamed and served as a hot vegetable with a sauce or as a cold salad or appetizer. Artichokes are a rich source of potassium, vitamin C, and dietary fibre."
    },
    {
        "name": "Ash-gourd",
        "imagename": "Ash-gourd",
        "description": "Ash gourd, also known as Benincasa hispida, winter melon, wax gourd, white pumpkin, and Chinese watermelon, is a fruit native to parts of Southern Asia (1). It grows on a vine and matures into a round or oblong melon that's approximately the same size and color as a watermelon."
    },
    {
        "name": "Asparagus",
        "imagename": "Asparagus",
        "description": "Asparagus, or garden asparagus, folk name sparrow grass, scientific name Asparagus officinalis, is a perennial flowering plant species in the genus Asparagus. Its young shoots are used as a spring vegetable. It was once classified in the lily family, like the related Allium species, onions and garlic."
    },
    {
        "name": "Beetroot",
        "imagename": "Beetroot",
        "description": "Beetroot contains nutrients that may improve athletic performance, boost heart health, manage glucose levels, and more. The nitrates in beets and beetroot juice may help improve blood flow, while antioxidants may protect against cancer."
    },
    {
        "name": "Bitter-gourd",
        "imagename": "Bitter-gourd",
        "description": "Momordica charantia is a tropical and subtropical vine of the family Cucurbitaceae, widely grown in Asia, Africa, and the Caribbean for its edible fruit. Its many varieties differ substantially in the shape and bitterness of the fruit."
    },
    {
        "name": "Bok-choy",
        "imagename": "Bok-choy",
        "description": "Bok Choy, also called white Chinese cabbage, belongs to the leafy vegetable pak choi family of Chinese brassicas. Bok Choy has white or green, thick, crunchy stems with light to dark green wide leaves. Size can vary from 4-12 inches tall! All parts, stems and leaves, are eaten."
    },
    {
        "name": "Bottle-gourd",
        "imagename": "Bottle-gourd",
        "description": "Calabash, also known as bottle gourd, white-flowered gourd, long melon, birdhouse gourd, New Guinea bean, Tasmania bean, and opo squash, is a vine grown for its fruit. bottle gourd, (Lagenaria siceraria), also called white-flowered gourd or calabash gourd, running or climbing vine of the gourd family (Cucurbitaceae), native to tropical Africa but cultivated in warm climates around the world for its ornamental and useful hard-shelled fruits."
    },
    {
        "name": "Brinjal",
        "imagename": "Brinjal",
        "description": "Eggplant, aubergine or brinjal is a plant species in the nightshade family Solanaceae. Solanum melongena is grown worldwide for its edible fruit. Most commonly purple, the spongy, absorbent fruit is used in several cuisines. Typically used as a vegetable in cooking, it is a berry by botanical definition. Brinjal is a hardy crop and is cultivated under a wide range of soils. Since a long duration crop with high yield, well -drained and fertile soil is preferred for the crop. Crops grown in sandy soils yield early and those grown in clayey soils yield more. Ideal pH for cultivation of crop is 5.5 - 6.6."
    },
    {
        "name": "Broccoli",
        "imagename": "Broccoli",
        "description": "Broccoli (Brassica oleracea var. italica) is an edible green plant in the cabbage family (family Brassicaceae, genus Brassica) whose large flowering head, stalk and small associated leaves are eaten as a vegetable. Broccoli is classified in the Italica cultivar group of the species Brassica oleracea."
    },
    {
        "name": "Brussels-sprout",
        "imagename": "Brussels-sprout",
        "description": "Brussels sprouts are named after Brussels, Belgium, where it is believed they were first widely cultivated in the 16th century. Sometimes called mini cabbages, they have appeared on “most hated vegetable” lists due to their potentially bitter flavors caused by sulfur-containing compounds."
    },
    {
        "name": "Cabbage",
        "imagename": "Cabbage",
        "description": "Cabbage, comprising several cultivars of Brassica oleracea, is a leafy green, red (purple), or white (pale green) biennial plant grown as an annual vegetable crop for its dense-leaved heads. It is descended from the wild cabbage (B. oleracea var."
    },
    {
        "name": "Capsicum",
        "imagename": "Capsicum",
        "description": "Capsicum, also known as red pepper or chili pepper, is an herb. Its fruit is commonly applied to the skin for arthritis pain and other conditions. The fruit of the capsicum plant contains a chemical called capsaicin. Capsaicin is what seems to help reduce pain and swelling."
    },
    {
        "name": "Carrot",
        "imagename": "Carrot",
        "description": "The carrot is a root vegetable, typically orange in color, though purple, black, red, white, and yellow cultivars exist, all of which are domesticated forms of the wild carrot, Daucus carota, native to Europe and Southwestern Asia.     Carrots are a fair source of B vitamins, like niacin and B6, which help our bodies use energy from foods. B vitamins are important for growth and healthy skin, hair, nerves and muscles. Carrots are also a fair source of vitamin C, which keeps our gums, teeth and skin healthy."
    },
    {
        "name": "Cauliflower",
        "imagename": "Cauliflower",
        "description": "Cauliflower is one of several vegetables in the species Brassica oleracea in the genus Brassica, which is in the Brassicaceae family. It is an annual plant that reproduces by seed. Typically, only the head is eaten – the edible white flesh is sometimes called 'curd'.     Cauliflower is rich in vitamin C which is good for skin, healing, and gum health. It is a cruciferous vegetable which helps prevent colon cancer. Cauliflower means “cabbage flower” because it is a flower that has not fully developed. Cauliflower is related to broccoli, Brussel sprouts, and cabbage."
    },
    {
        "name": "Celery",
        "imagename": "Celery",
        "description": "Celery is a marshland plant in the family Apiaceae that has been cultivated as a vegetable since antiquity. Celery has a long fibrous stalk tapering into leaves. Depending on location and cultivar, either its stalks, leaves or hypocotyl are eaten and used in cooking. Celery seed powder is used as a spice.      Celery contains vitamins A, K, C, and B6, among others. Like other vegetables, celery supports heart health, skin health, and overall provides great nutrition! Celery is related to carrots, fennel, and parsley. Celery seeds are the size of a period."
    },
    {
        "name": "Chayote",
        "imagename": "Chayote",
        "description": "Chayote, also known as mirliton and choko, is an edible plant belonging to the gourd family, Cucurbitaceae. This fruit was first cultivated in Mesoamerica between southern Mexico and Honduras, with the most genetic diversity available in both Mexico and Guatemala.        Chayote is a thin-skinned squash originally from Mexico. A member of the gourd family, the bumpy green fruit is commonly available in the Southwestern United States, but it remains a novelty item in much of the country. Chayote squash (Sechium edule) is technically a fruit but is eaten like a vegetable."
    },
    {
        "name": "Chickpea",
        "imagename": "Chickpea",
        "description": "The chickpea or chick pea is an annual legume of the family Fabaceae, subfamily Faboideae. Its different types are variously known as gram or Bengal gram, chhana, chana, or channa, garbanzo or garbanzo bean, or Egyptian pea. Chickpea seeds are high in protein. Consumers of chickpeas and/or hummus have been shown to have higher nutrient intakes of dietary fiber, polyunsaturated fatty acids, vitamin A, vitamin E, vitamin C, folate, magnesium, potassium, and iron as compared to non-consumers."
    },
    {
        "name": "Chilli",
        "imagename": "Chilli",
        "description": "Chili peppers, from Nahuatl chīlli, are varieties of the berry-fruit of plants from the genus Capsicum, which are members of the nightshade family Solanaceae, cultivated for their pungency. Chili peppers are widely used in many cuisines as a spice to add heat to dishes. Capsaicin and several related alkaloids are called capsaicinoids and are produced as secondary metabolites by chili peppers, probably as deterrents against certain mammals and fungi. Pure capsaicin is a hydrophobic, colorless, highly pungent, crystalline to waxy solid compound. Capsaicin (CAP) is the main pungent ingredient of chili peppers [1], which are spices with a unique spicy flavor widely consumed in various diets.  Baby Pepper chilli is a cherry type hot pepper that reaches maturity in 75 days. The colour of the Baby Pepper varies from light green to dark red. The round fruits have a diameter of 3.5 cm."
    },
    {
        "name": "Coriander",
        "imagename": "Coriander",
        "description": "Coriander, also known as cilantro, is an annual herb in the family Apiaceae. All parts of the plant are edible, but the fresh leaves and the dried seeds are the parts most traditionally used in cooking. Coriander (/ˌkɒriˈændər, ˈkɒriændər/; Coriandrum sativum), also known as cilantro (/sɪˈlæntroʊ, -ˈlɑːn-/), is an annual herb in the family Apiaceae. All parts of the plant are edible, but the fresh leaves and the dried seeds are the parts most traditionally used in cooking."
    },
    {
        "name": "Corn",
        "imagename": "Corn",
        "description": "Maize, also known as corn in North American and Australian English, is a cereal grain first domesticated by indigenous peoples in southern Mexico about 10,000 years ago. Corn is a tall annual cereal grass (Zea mays) that is widely grown for its large elongated ears of starchy seeds. The seeds, which are also known as corn, are used as food for humans and livestock and as a source of biofuel and can be processed into a wide range of useful chemicals."
    },
    {
        "name": "Cucumber",
        "imagename": "Cucumber",
        "description": "The cucumber is a widely-cultivated creeping vine plant in the family Cucurbitaceae that bears cylindrical to spherical fruits, which are used as culinary vegetables. Considered an annual plant, there are three main types of cucumber—slicing, pickling, and seedless—within which several cultivars have been created.  cucumber, (Cucumis sativus), creeping plant of the gourd family (Cucurbitaceae), widely cultivated for its edible fruit. The nutritional value of the cucumber is low, but its delicate flavour makes it popular for salads and relishes. Small fruits are often pickled."
        
    },
    {
        "name": "Drumstick",
        "imagename": "Drumstick",
        "description": "Drumstick is a fast-growing tree and widely cultivated for its tender seed pod, leaves used as vegetable heaped with vital nutrients and as a medicine in Siddha for its indispensable medicinal properties. Moringa, a slender, deciduous tree grows to a height to 10-12 m and a trunk diameter of 45cm."
    },
    {
        "name": "Endive",
        "imagename": "Endive",
        "description": "Endive is a leaf vegetable belonging to the genus Cichorium, which includes several similar bitter-leafed vegetables. Species include Cichorium endivia, Cichorium pumilum, and Cichorium intybus. Common chicory includes types such as radicchio, puntarelle, and Belgian endive.  Endive is a good source of vitamins B, C, and K and minerals calcium, iron, zinc, magnesium, potassium, folate, and selenium. Endive can be grown year-round. There is only one calorie per endive leaf."
    },
    {
        "name": "Garlic",
        "imagename": "Garlic",
        "description": "Garlic is a species of bulbous flowering plant in the genus Allium. Its close relatives include the onion, shallot, leek, chive, Welsh onion and Chinese onion. Garlic is widely used around the world for its pungent flavor as a seasoning or condiment. The garlic plant's bulb is the most commonly used part of the plant. With the exception of the single clove types, garlic bulbs are normally divided into numerous fleshy sections called cloves."
    },
    {
        "name": "Ginger",
        "imagename": "Ginger",
        "description": "Ginger is a flowering plant whose rhizome, ginger root or ginger, is widely used as a spice and a folk medicine. It is a herbaceous perennial which grows annual pseudostems about one meter tall bearing narrow leaf blades"
    },
    {
        "name": "Green-bean",
        "imagename": "Green-bean",
        "description": "Green beans are young, unripe fruits of various cultivars of the common bean, although immature or young pods of the runner bean, yardlong bean, and hyacinth bean are used in a similar way. Green beans are known by many common names, including French beans, string beans, and snap beans or simply snaps. Green Beans are a good source of carbohydrates. They also contain fiber, vitamin C, vitamin K, and beta carotene. Green beans are also called string beans and snap beans. They taste the best when they are thinner than a pencil."
    },
    {
        "name": "Jackfruit",
        "imagename": "Jackfruit",
        "description": "The jackfruit, also known as the jack tree, is a species of tree in the fig, mulberry, and breadfruit family. Its origin is in the region between the Western Ghats of southern India.  Jackfruit is the largest tree-borne fruit in the world, reaching up to 60 cm (about 2 feet) long and weighing up to 18 kg (about 40 pounds). It is ellipsoidal and aggregate, composed of multiple “bulbs” of seed-containing flesh around a stringy core, all of which is enclosed by a bumpy rind."
    },
    {
        "name": "Kohlrabi",
        "imagename": "Kohlrabi",
        "description": "Kohlrabi, also called German turnip or turnip cabbage, is a biennial vegetable, a low, stout cultivar of wild cabbage. It is a cultivar of the same species as cabbage, broccoli, cauliflower, kale, Brussels sprouts, collard greens, Savoy cabbage, and gai lan. It can be eaten raw or cooked.  Kohlrabi is a great source of potassium, vitamin C, and fiber. Kohlrabi is related to cabbage, broccoli, kale, cauliflower, and brussels sprouts. Kohlrabi's name originated from the German words “kohl,” meaning cabbage, and “rube,” meaning turnip."
    },
    {
        "name": "Lady-finger",
        "imagename": "Lady-finger",
        "description": "Ladyfinger contains vitamin K, folate, and iron. These are considered some of the natural nutrients that may help manage anaemia. It may also facilitate the production of haemoglobin, red blood cells and blood clotting. All these actions may protect against anaemia.  Okra or okro, Abelmoschus esculentus, known in many English-speaking countries as Okro, is a flowering plant in the mallow family. It has edible green seed pods. The geographical origin of okra is disputed, with supporters of West African, Ethiopian, Southeast Asian, and South Asian origins."
    },
    {
        "name": "Leek",
        "imagename": "Leek",
        "description": "The leek is a vegetable, a cultivar of Allium ampeloprasum, the broadleaf wild leek. The edible part of the plant is a bundle of leaf sheaths that is sometimes erroneously called a stem or stalk. The genus Allium also contains the onion, garlic, shallot, scallion, chives, and Chinese onion.  Leeks are very high in Vitamins A and K and are good sources of Vitamin B-6, folate, iron, calcium and manganese. They are also high in fiber and low in calories. Leeks are also a mild diuretic (there is even a “leek soup diet” that supposedly helps with weight loss) and are high in antioxidant polyphenols."
    },
    {
        "name": "Lentil",
        "imagename": "Lentil",
        "description": "The lentil is an edible legume. It is an annual plant known for its lens-shaped seeds. It is about 40 cm tall, and the seeds grow in pods, usually with two seeds in each. As a food crop, the largest producer is Canada, producing 45% of the world’s total lentils. Lentils are used around the world for culinary purposes."
    },
    {
        "name": "Luffa",
        "imagename": "Luffa",
        "description": "Luffa aegyptiaca, the sponge gourd, Egyptian cucumber or Vietnamese luffa, is an annual species of vine cultivated for its fruit, native to South and Southeast Asia."
    },
    {
        "name": "Mushroom",
        "imagename": "Mushroom",
        "description": "A mushroom or toadstool is the fleshy, spore-bearing fruiting body of a fungus, typically produced above ground, on soil, or on its food source. Toadstool generally denotes one poisonous to humans.  A mushroom is the reproductive structure produced by some fungi. It is somewhat like the fruit of a plant, except that the seeds it produces are in fact millions of microscopic spores that form in the gills or pores underneath the mushroom's cap."
    },
    {
        "name": "Onion",
        "imagename": "Onion",
        "description": "An onion, also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. The shallot is a botanical variety of the onion which was classified as a separate species until 2011. Its close relatives include garlic, scallion, leek, and chive.  The distinctive smell is caused by sulfur-containing chemicals in garlic and onion. The smell can linger on a person's breath for hours and even overnight, which discourages some people from eating these vegetables.  Onion plants have fibrous roots. Fibrous roots arise from the base of the stem leaves rather than from the radicle. They are bushy roots formed by several thin, hairy, and moderately branched roots. Onion root tips containing meristematic cells are used for microscopic study of mitosis cell division stages."
    },
    {
        "name": "Parsnip",
        "imagename": "Parsnip",
        "description": "he parsnip is a root vegetable closely related to carrot and parsley, all belonging to the flowering plant family Apiaceae. It is a biennial plant usually grown as an annual. Its long taproot has cream-colored skin and flesh, and, left in the ground to mature, it becomes sweeter in flavor after winter frosts.  Parsnips are a cultivated subspecies of Pastinaca sativa, or wild parsnip. Pastinaca sativa is a native species found all throughout Europe and Central Asia. Historically, the edible root was used for occasional food purposes, especially during the time of the ancient Greeks and Romans about 2,000 years ago."
    },
    {
        "name": "Peas",
        "imagename": "Peas",
        "description": "The pea is most commonly the small spherical seed or the seed-pod of the flowering plant species Pisum sativum. Each pod contains several peas, which can be green or yellow. Botanically, pea pods are fruit, since they contain seeds and develop from the ovary of a (pea). "
    },
    {
        "name": "Pointed-gourd",
        "imagename": "Pointed-gourd",
        "description": "Trichosanthes dioica Roxb., also known as pointed gourd, is a tropical perennial cucurbit plant with its origin in the Indian subcontinent. It is also known as parwal, palwal, potol, or parmalin in different parts of India and Bangladesh."
    },
    {
        "name": "Potato",
        "imagename": "Potato",
        "description": "The potato is a starchy food, a tuber of the plant Solanum tuberosum and is a root vegetable native to the Americas. The plant is a perennial in the nightshade family Solanaceae. Wild potato species can be found from the southern United States to southern Chile.  The potato is a starchy food, a tuber of the plant Solanum tuberosum and is a root vegetable native to the Americas. The plant is a perennial in the nightshade family Solanaceae. Potato cultivars appear in a variety of colors, shapes, and sizes."
    },
    {
        "name": "Pumpkin",
        "imagename": "Pumpkin",
        "description": "Pumpkin is a plump, nutritious orange vegetable, and a highly nutrient dense food. It is low in calories but rich in vitamins and minerals, all of which are also in its seeds, leaves, and juices. There are many ways to incorporate pumpkin into desserts, soups, salads, preserves, and even as a substitute for butter.  A pumpkin is a vernacular term for mature winter squash of species and varieties in the genus Cucurbita that has culinary and cultural significance but no agreed upon botanical or scientific meaning."
    },
    {
        "name": "Radish",
        "imagename": "Radish",
        "description": "The radish is an edible root vegetable of the family Brassicaceae that was domesticated in Asia prior to Roman times.  Image result for Radish Information.Radishes are annual or biennial brassicaceous crops grown for their swollen tap roots which can be globular, tapering, or cylindrical. The root skin colour ranges from white through pink, red, purple, yellow, and green to black, but the flesh is usually white. The roots obtain their color from anthocyanins."
    },
    {
        "name": "Ridged-gourd",
        "imagename": "Ridged-gourd",
        "description": "Luffa acutangula is a cucurbitaceous vine that is commercially grown for its unripe fruits as a vegetable. Mature fruits are used as natural cleaning sponges. Its fruit slightly resembles a cucumber or zucchini with ridges. It ranges from central and eastern Asia to southeastern Asia."
    },
    {
        "name": "Spinach",
        "imagename": "Spinach",
        "description": "Spinach is a leafy green flowering plant native to central and western Asia. It is of the order Caryophyllales, family Amaranthaceae, subfamily Chenopodioideae. Its leaves are a common edible vegetable consumed either fresh, or after storage using preservation techniques by canning, freezing, or dehydration.  Spinach is a nutritious leafy, green vegetable that may benefit skin, hair, and bone health. It is rich in multiple vitamins and minerals. The possible health benefits of consuming spinach include improving blood glucose control in people with diabetes, lowering the risk of cancer, and improving bone health."
    },
    {
        "name": "Sweet-potato",
        "imagename": "Sweet-potato",
        "description": "The sweet potato or sweetpotato is a dicotyledonous plant that belongs to the bindweed or morning glory family, Convolvulaceae. Its large, starchy, sweet-tasting tuberous roots are used as a root vegetable. The young shoots and leaves are sometimes eaten as greens.  The sweet potato or sweetpotato (Ipomoea batatas) is a dicotyledonous plant that belongs to the bindweed or morning glory family, Convolvulaceae. Its large, starchy, sweet-tasting tuberous roots are used as a root vegetable. The young shoots and leaves are sometimes eaten as greens."
    },
    {
        "name": "Swiss-chard",
        "imagename": "Swiss-chard",
        "description": "Chard or Swiss chard is a green leafy vegetable. In the cultivars of the Flavescens Group, the leaf stalks are large and often prepared separately from the leaf blade; the Cicla Group is the leafy spinach beet. The leaf blade can be green or reddish; the leaf stalks are usually white, yellow or red.  Swiss chard grows well in both cool and warm environments. 6-8 hours of sunlight per day is required for Swiss chard to thrive. A 10-foot row of Swiss chard can produce roughly 12 pounds of produce. Like other leafy greens, Swiss chard is high in vitamin A, vitamin K, calcium, potassium and fiber."
    },
    {
        "name": "Tomato",
        "imagename": "Tomato",
        "description": "Tomato, (Solanum lycopersicum), flowering plant of the nightshade family (Solanaceae), cultivated extensively for its edible fruits. Labelled as a vegetable for nutritional purposes, tomatoes are a good source of vitamin C and the phytochemical lycopene."
    },
    {
        "name": "Turnip",
        "imagename": "Turnip",
        "description": "The turnip or white turnip is a root vegetable commonly grown in temperate climates worldwide for its white, fleshy taproot. The word turnip is a compound of turn as in turned/rounded on a lathe and neep, derived from Latin napus, the word for the plant.  turnip, (Brassica rapa, variety rapa), also known as white turnip, hardy biennial plant in the mustard family (Brassicaceae), cultivated for its fleshy roots and tender growing tops. The turnip is thought to have originated in middle and eastern Asia and is grown throughout the temperate zone."
    },
    {
        "name": "Yam",
        "imagename": "Yam",
        "description": "Yam is the common name for some plant species in the genus Dioscorea that form edible tubers. The tubers of some other species in the genus, such as D. communis, are toxic.  Yams are a tuber vegetable that grows underground. 95% of the world's yams are grown in sub-Saharan Africa. Yams are a good source of carbohydrates and fiber. Yams and sweet potatoes are often grouped together but they are not the same thing."
    },
    {
        "name": "Zucchini",
        "imagename": "Zucchini",
        "description": "The zucchini, courgette or baby marrow is a summer squash, a vining herbaceous plant whose fruit are harvested when their immature seeds and epicarp are still soft and edible. It is closely related, but not identical, to the marrow; its fruit may be called marrow when mature.  zucchini, (Cucurbita pepo), also called courgette, variety of summer squash in the gourd family (Cucurbitaceae), grown for its edible fruits. Zucchinis are common in home gardens and supermarkets, and the young fruits are cooked as a vegetable. The flowers are also edible and are sometimes fried."
    }
]
 
